# pandas: Exercises
-  We will use the Occupation data set provided by Kevin Markham https://github.com/justmarkham.

In [9]:
# import pandas
import pandas as pd
from pandas import Series, DataFrame
# import Numpy
import numpy as np

## Load the Data Set

In [10]:
# load the data set, index_col = 'user_id'
data = pd.read_csv('Occupation.csv', index_col = 'user_id')

In [11]:
frame = pd.DataFrame(data)
frame

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator     5201
9         29      M        student     1002
10        53      M         lawyer    90703
11        39      F          other    30329
12        28      F          other     6405
13        47      M       educator    29206
14        45      M      scientist    55106
15        49      F       educator    97301
16        21      M  entertainment    10309
17        30      M     programmer     6355
18        35      F          other    37212
19        40      M      librarian     2138
20        42      F      homemaker    95660
21        26      M         writer    30068
22        25      M         writer    40206
23        30      F         artist    48197
24        21      F         artist    94533
25        39      M       engineer    55107
26        49      M       engineer    21044
27        40      F      librarian    30030
28        32      M         writer    55369
29        41      M     programmer    94043
30         7      M        student    55436
...      ...    ...            ...      ...
914       44      F          other     8105
915       50      M  entertainment    60614
916       27      M       engineer    N2L5N
917       22      F        student    20006
918       40      M      scientist    70116
919       25      M          other    14216
920       30      F         artist    90008
921       20      F        student    98801
922       29      F  administrator    21114
923       21      M        student    E2E3R
924       29      M          other    11753
925       18      F       salesman    49036
926       49      M  entertainment     1701
927       23      M     programmer    55428
928       21      M        student    55408
929       44      M      scientist    53711
930       28      F      scientist     7310
931       60      M       educator    33556
932       58      M       educator     6437
933       28      M        student    48105
934       61      M       engineer    22902
935       42      M         doctor    66221
936       24      M          other    32789
937       48      M       educator    98072
938       38      F     technician    55038
939       26      F        student    33319
940       32      M  administrator     2215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

[943 rows x 4 columns]

## Explore Data

### 1. Show the first five observations.

In [12]:
pass
data[:5]

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

In [13]:
data.head()

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

### 2. How many rows are there in the data set?

In [14]:
pass
len(data.index)

943

In [15]:
data.shape

(943, 4)

In [16]:
data.columns

Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

### 3. How many columns are there in the data set?

In [17]:
pass
# or data.shape for rows and columns
len(data.columns)

4

### 4. Is there any missing value in the data set?

In [18]:
pass
#data.isnull().any(axis=1)
data.isnull().sum()

age           0
gender        0
occupation    0
zip_code      0
dtype: int64

### 5. Output the column names.

In [19]:
pass
list(data.columns)

['age', 'gender', 'occupation', 'zip_code']

### 6. Output the 100th subject's index.

In [20]:
data.iloc[100]

age                15
gender              M
occupation    student
zip_code         5146
Name: 101, dtype: object

### 7. How old is the 15th subject?

In [21]:
pass
data.iloc[14][0]

49

### 8. How many subjects are younger than 25 years old?

In [36]:
pass
#len([v[0] for v in data[:,0] if v[0] < 25])
#data["age"] <z 25
#(data.loc[ data['occupation'] == 'other'].count() and data.loc[data['age'] < 25]).count()
(data.loc[data['age'] < 25]).count()

age           234
gender        234
occupation    234
zip_code      234
dtype: int64

In [30]:
(data.loc[data['age'] < 25]).count()

age           234
gender        234
occupation    234
zip_code      234
dtype: int64

In [42]:
data.loc[(data.age < 25) & (data.occupation == 'other')].count()
#users[(users.age < 20) & (users.gender=='M')]

age           17
gender        17
occupation    17
zip_code      17
dtype: int64

## Aggregate Data

### 9. How many different occupations are there in the data set?

In [5]:
#users.occupation.nunique()
#or by using value_counts() which returns the count of unique elements
#users.occupation.value_counts().count()

pass
data.occupation.nunique()

21

### 10. What is the most frequent occupation?

In [72]:
#users.occupation.value_counts().head(1).index[0]
pass
data.occupation.value_counts().head()

student          196
other            105
educator          95
administrator     79
engineer          67
Name: occupation, dtype: int64

### 11. What is the mean age of the subjects?

In [74]:
pass
round(data.age.mean())

34

### 12. What is the occupation of the oldest subject?

In [55]:
pass
#data.groupby('occupation').age.agg('max')
data.sort_values(['age'], ascending = False).head()

         age gender     occupation zip_code  occupation_num
user_id
481       73      M        retired    37771              18
803       70      M  administrator    78212               4
767       70      M       engineer        0              14
860       70      F        retired    48322              18
585       69      M      librarian    98501              11

In [78]:
#data.sort_values(['age','occupation']).head()
data.groupby('occupation').age.agg('max')

occupation
administrator    70
artist           48
doctor           64
educator         63
engineer         70
entertainment    50
executive        69
healthcare       62
homemaker        50
lawyer           53
librarian        69
marketing        55
none             55
other            64
programmer       63
retired          73
salesman         66
scientist        55
student          42
technician       55
writer           60
Name: age, dtype: int64

In [56]:
#data[data.age.max()].occupation

#data.sort('age')
#data[data.age.value_counts()].occupation
#data.sort_values(['age'], ascending = False).head()
data.groupby('occupation').age.agg('max')

occupation
administrator    70
artist           48
doctor           64
educator         63
engineer         70
entertainment    50
executive        69
healthcare       62
homemaker        50
lawyer           53
librarian        69
marketing        55
none             55
other            64
programmer       63
retired          73
salesman         66
scientist        55
student          42
technician       55
writer           60
Name: age, dtype: int64

### 13. What is the least frequent occuptation among the male subjects?

In [81]:
pass
data[data.gender.isin(['M'])].occupation.value_counts().index[-1]

'homemaker'

In [90]:
data.occupation.value_counts()

student          196
other            105
educator          95
administrator     79
engineer          67
programmer        66
librarian         51
writer            45
executive         32
scientist         31
artist            28
technician        27
marketing         26
entertainment     18
healthcare        16
retired           14
lawyer            12
salesman          12
none               9
doctor             7
homemaker          7
Name: occupation, dtype: int64

### 14. What is the mean age of each occupation?

In [9]:
#drinks.groupby('continent').beer.mean()
pass
data.groupby('occupation').age.mean()

occupation
administrator    38.746835
artist           31.392857
doctor           43.571429
educator         42.010526
engineer         36.388060
entertainment    29.222222
executive        38.718750
healthcare       41.562500
homemaker        32.571429
lawyer           36.750000
librarian        40.000000
marketing        37.615385
none             26.555556
other            34.523810
programmer       33.121212
retired          63.071429
salesman         35.666667
scientist        35.548387
student          22.081633
technician       33.148148
writer           36.311111
Name: age, dtype: float64

In [18]:
data['occupation_num'] = data.occupation.factorize()[0]
data

         age gender     occupation zip_code  occupation_num
user_id
1         24      M     technician    85711               0
2         53      F          other    94043               1
3         23      M         writer    32067               2
4         24      M     technician    43537               0
5         33      F          other    15213               1
6         42      M      executive    98101               3
7         57      M  administrator    91344               4
8         36      M  administrator     5201               4
9         29      M        student     1002               5
10        53      M         lawyer    90703               6
11        39      F          other    30329               1
12        28      F          other     6405               1
13        47      M       educator    29206               7
14        45      M      scientist    55106               8
15        49      F       educator    97301               7
16        21      M  entertainment    10309               9
17        30      M     programmer     6355              10
18        35      F          other    37212               1
19        40      M      librarian     2138              11
20        42      F      homemaker    95660              12
21        26      M         writer    30068               2
22        25      M         writer    40206               2
23        30      F         artist    48197              13
24        21      F         artist    94533              13
25        39      M       engineer    55107              14
26        49      M       engineer    21044              14
27        40      F      librarian    30030              11
28        32      M         writer    55369               2
29        41      M     programmer    94043              10
30         7      M        student    55436               5
...      ...    ...            ...      ...             ...
914       44      F          other     8105               1
915       50      M  entertainment    60614               9
916       27      M       engineer    N2L5N              14
917       22      F        student    20006               5
918       40      M      scientist    70116               8
919       25      M          other    14216               1
920       30      F         artist    90008              13
921       20      F        student    98801               5
922       29      F  administrator    21114               4
923       21      M        student    E2E3R               5
924       29      M          other    11753               1
925       18      F       salesman    49036              19
926       49      M  entertainment     1701               9
927       23      M     programmer    55428              10
928       21      M        student    55408               5
929       44      M      scientist    53711               8
930       28      F      scientist     7310               8
931       60      M       educator    33556               7
932       58      M       educator     6437               7
933       28      M        student    48105               5
934       61      M       engineer    22902              14
935       42      M         doctor    66221              20
936       24      M          other    32789               1
937       48      M       educator    98072               7
938       38      F     technician    55038               0
939       26      F        student    33319               5
940       32      M  administrator     2215               4
941       20      M        student    97229               5
942       48      F      librarian    78209              11
943       22      M        student    77841               5

[943 rows x 5 columns]

In [91]:
type(data)

pandas.core.frame.DataFrame

In [92]:
data.dtypes

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

In [93]:
data.index

Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
           dtype='int64', name='user_id', length=943)

In [94]:
data.columns

Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

In [95]:
data.shape

(943, 4)

In [98]:
data.values

array([[24, 'M', 'technician', '85711'],
       [53, 'F', 'other', '94043'],
       [23, 'M', 'writer', '32067'],
       ...,
       [20, 'M', 'student', '97229'],
       [48, 'F', 'librarian', '78209'],
       [22, 'M', 'student', '77841']], dtype=object)

In [99]:
data.gender.describe()

count     943
unique      2
top         M
freq      670
Name: gender, dtype: object

In [100]:
data.gender.value_counts()

M    670
F    273
Name: gender, dtype: int64

In [102]:
data.age.value_counts()

30    39
25    38
22    37
28    36
27    35
26    34
24    33
29    32
20    32
32    28
23    28
35    27
21    27
33    26
31    25
19    23
44    23
39    22
40    21
36    21
42    21
51    20
50    20
48    20
49    19
37    19
18    18
34    17
38    17
45    15
      ..
47    14
43    13
46    12
53    12
55    11
41    10
57     9
60     9
52     6
56     6
15     6
13     5
16     5
54     4
63     3
14     3
65     3
70     3
61     3
59     3
58     3
64     2
68     2
69     2
62     2
11     1
10     1
73     1
66     1
7      1
Name: age, Length: 61, dtype: int64

In [103]:
data.shape[0]

943

In [106]:
young_bool = data.age < 20 
young_bool.value_counts()

False    866
True      77
Name: age, dtype: int64

In [108]:
data[data.age < 20].occupation.nunique()

7

In [47]:
data[data.age < 20].occupation.value_counts().nunique()

5

In [43]:
data[data.age < 20].occupation.value_counts()

student          64
other             4
none              3
writer            2
entertainment     2
salesman          1
artist            1
Name: occupation, dtype: int64

In [45]:
data.occupation.value_counts()

student          196
other            105
educator          95
administrator     79
engineer          67
programmer        66
librarian         51
writer            45
executive         32
scientist         31
artist            28
technician        27
marketing         26
entertainment     18
healthcare        16
retired           14
salesman          12
lawyer            12
none               9
homemaker          7
doctor             7
Name: occupation, dtype: int64

In [44]:
data[data.age < 20].occupation

user_id
30           student
36           student
52           student
57              none
67           student
68           student
101          student
110          student
142            other
179    entertainment
206          student
221          student
223          student
246          student
257          student
258          student
262          student
270          student
281          student
289             none
291          student
303          student
320          student
341          student
347          student
367          student
368          student
375    entertainment
393          student
397          student
           ...
601           artist
609          student
618          student
619          student
620           writer
621          student
624          student
628             none
631          student
632          student
642          student
646          student
674          student
700          student
710          student
729          student
747            other
761          student
787          student
813          student
817          student
849          student
851            other
859            other
863          student
872          student
880          student
887          student
904          student
925         salesman
Name: occupation, Length: 77, dtype: object

In [48]:
data.sum(axis=1)

user_id
1      24
2      53
3      23
4      24
5      33
6      42
7      57
8      36
9      29
10     53
11     39
12     28
13     47
14     45
15     49
16     21
17     30
18     35
19     40
20     42
21     26
22     25
23     30
24     21
25     39
26     49
27     40
28     32
29     41
30      7
       ..
914    44
915    50
916    27
917    22
918    40
919    25
920    30
921    20
922    29
923    21
924    29
925    18
926    49
927    23
928    21
929    44
930    28
931    60
932    58
933    28
934    61
935    42
936    24
937    48
938    38
939    26
940    32
941    20
942    48
943    22
Length: 943, dtype: int64

In [49]:
data.sum(axis=0)

age                                                       32111
gender        MFMMFMMMMMFFMMFMMFMFMMFFMMFMMMMFMFFFMFMMMMFMMF...
occupation    technicianotherwritertechnicianotherexecutivea...
zip_code      8571194043320674353715213981019134452011002907...
dtype: object